---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.WallSweep
source: html/214c657c-4f4d-758e-9196-0d0af537c238.htm
---
# WallSweep Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.